driver-tests/bpelse/assign/AssignJbi/test/echoNormalizedStringDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://stc.com/echoNormalizedStringDataType">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoNormalizedStringDataType">
    <string>normalizedString </string>
    <normalizedString>normalizedString </normalizedString>
    <token>normalizedString </token>
    <base64Binary>normalizedString </base64Binary>
    <hexBinary>normalizedString </hexBinary>
    <integer>normalizedString </integer>
    <positiveInteger>normalizedString </positiveInteger>
    <negativeInteger>normalizedString </negativeInteger>
    <nonNegativeInteger>normalizedString </nonNegativeInteger>
    <nonPositiveInteger>normalizedString </nonPositiveInteger>
    <long>normalizedString </long>
    <unsignedLong>normalizedString </unsignedLong>
    <int>normalizedString </int>
    <unsignedInt>normalizedString </unsignedInt>
    <short>normalizedString </short>
    <unsignedShort>normalizedString </unsignedShort>
    <byte>normalizedString </byte>
    <unsignedByte>normalizedString </unsignedByte>
    <decimal>normalizedString </decimal>
    <float>normalizedString </float>
    <double>normalizedString </double>
    <boolean>normalizedString </boolean>
    <duration>normalizedString </duration>
    <dateTime>normalizedString </dateTime>
    <date>normalizedString </date>
    <time>normalizedString </time>
    <gYear>normalizedString </gYear>
    <gYearMonth>normalizedString </gYearMonth>
    <gMonth>normalizedString </gMonth>
    <gMonthDay>normalizedString </gMonthDay>
    <gDay>normalizedString </gDay>
    <Name>normalizedString </Name>
    <QName>normalizedString </QName>
    <NCName>normalizedString </NCName>
    <anyURI>normalizedString </anyURI>
    <language>normalizedString </language>
    <ID>normalizedString </ID>
    <IDREF>normalizedString </IDREF>
    <IDREFS>normalizedString </IDREFS>
    <ENTITY>normalizedString </ENTITY>
    <ENTITIES>normalizedString </ENTITIES>
    <NMTOKEN>normalizedString </NMTOKEN>
    <NMTOKENS>normalizedString </NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
